In [1]:
print("h")

h

In [2]:
import pandas as pd
import numpy as np

data = {
    'Order_ID': [101, 102, 103, 104, 105, 106],
    'Customer': ['Alice', 'Bob', 'Charlie', 'Alice', 'Eve', 'Bob'],
    'Drink': ['Latte', 'Espresso', 'Cappuccino', 'Latte', 'Tea', 'Espresso'],
    'Price': [4.5, 3.0, np.nan, 4.5, 2.5, np.nan],
    'Quantity': [2, 1, 1, np.nan, 3, 2],
    'Region': ['North', 'South', 'North', 'North', 'West', 'South']
}

df_coffee = pd.DataFrame(data)
print(df_coffee)

   Order_ID Customer       Drink  Price  Quantity Region
0       101    Alice       Latte    4.5       2.0  North
1       102      Bob    Espresso    3.0       1.0  South
2       103  Charlie  Cappuccino    NaN       1.0  North
3       104    Alice       Latte    4.5       NaN  North
4       105      Eve         Tea    2.5       3.0   West
5       106      Bob    Espresso    NaN       2.0  South

In [3]:
df_coffee

   Order_ID Customer       Drink  Price  Quantity Region
0       101    Alice       Latte    4.5       2.0  North
1       102      Bob    Espresso    3.0       1.0  South
2       103  Charlie  Cappuccino    NaN       1.0  North
3       104    Alice       Latte    4.5       NaN  North
4       105      Eve         Tea    2.5       3.0   West
5       106      Bob    Espresso    NaN       2.0  South

In [8]:
df_coffee.isnull().sum()

Order_ID    0
Customer    0
Drink       0
Price       2
Quantity    1
Region      0
dtype: int64

In [11]:
df_coffee['Price'].fillna(df_coffee['Price'].mean())

0    4.500
1    3.000
2    3.625
3    4.500
4    2.500
5    3.625
Name: Price, dtype: float64

In [10]:
df_coffee

   Order_ID Customer       Drink  Price  Quantity Region
0       101    Alice       Latte    4.5       2.0  North
1       102      Bob    Espresso    3.0       1.0  South
2       103  Charlie  Cappuccino    NaN       1.0  North
3       104    Alice       Latte    4.5       NaN  North
4       105      Eve         Tea    2.5       3.0   West
5       106      Bob    Espresso    NaN       2.0  South

In [27]:
df_coffee = df_coffee.rename(columns={'Order_ID':'ID','INk':'Drink'})

In [22]:
df_coffee['Quantity']=df_coffee['Quantity'].fillna(df_coffee['Quantity'].mean())
df_coffee['Quantity'].astype(int)
df_coffee['New'] = df_coffee['Quantity']*df_coffee['Price']
df_coffee

    ID Customer         INk  Price  Quantity Region  New
0  101    Alice       Latte    4.5       2.0  North  9.0
1  102      Bob    Espresso    3.0       1.0  South  3.0
2  103  Charlie  Cappuccino    NaN       1.0  North  NaN
3  104    Alice       Latte    4.5       1.8  North  8.1
4  105      Eve         Tea    2.5       3.0   West  7.5
5  106      Bob    Espresso    NaN       2.0  South  NaN

In [25]:
df_coffee.groupby(['Customer']).sum()# This focuses only on the money
df_coffee.groupby('Customer')['New'].sum()

Customer
Alice      17.1
Bob         3.0
Charlie     0.0
Eve         7.5
Name: New, dtype: float64

In [26]:
df_calories = pd.DataFrame({
    'Drink': ['Latte', 'Espresso', 'Cappuccino', 'Tea'],
    'Calories': [150, 5, 120, 2]
})

In [29]:
pd.merge(df_calories, df_coffee, on='Drink', how='inner')

        Drink  Calories   ID Customer  Price  Quantity Region  New
0       Latte       150  101    Alice    4.5       2.0  North  9.0
1       Latte       150  104    Alice    4.5       1.8  North  8.1
2    Espresso         5  102      Bob    3.0       1.0  South  3.0
3    Espresso         5  106      Bob    NaN       2.0  South  NaN
4  Cappuccino       120  103  Charlie    NaN       1.0  North  NaN
5         Tea         2  105      Eve    2.5       3.0   West  7.5

In [31]:
df_coffee.groupby('Region')['New'].agg(['mean', 'max'])

        mean  max
Region
North   8.55  9.0
South   3.00  3.0
West    7.50  7.5